给一个矩阵, 找出所有从左上到右下path最小值中的最大值.
eg: 
{8,4,3,5}
{6,5,9,8}

所有的path:

8->4->3->5->8 min:3

8->4->3->9->8 min:3

8->4->5->9->8 min:5

8->6->5->9->8 min:5

Result = Math.max(3,3,5,5,) = 5
  
---------------- DP ------------------------------------------------------
DP[i][j]:到达i,j这个点时所有path最小值中的最大值

公式：只能想几个例子走一遍了，不好解释
if m[i][j] < dp[i-1][j] && dp[i][j-1], dp[i][j] = max(dp[i-1][j], dp[i][j-1])
if m[i][j] > dp[i-1][j] && dp[i][j-1], dp[i][j] = m[i][j]
if dp[i][j-1] < m[i][j] < dp[i-1][j]或相反，dp[i][j] = m[i][j]. 
  
return dp[m][n]   
  
  


